public class ex47 {
    public static void main(String[] args) {

        //함수(메소드)

        //코드중복 제거하는 방법
        //1. 반복문 사용
        //2. 배열을사용
        //3. 함수 사용
        //4. 클래스(변수+함수) 사용
        //5. 함수 안에서 함수 선언 안됨

        //함수란?
        //1. 코드 뭉치(블록)
        //2. 코드뭉치에 이름을 붙이고(가독성)
        //3. 다른 함수를 실행할 수 있다(재사용성)
        //4. 입력값과 출력값이 있음

        //함수의 선언부 형식
        //반환형 함수이름(매개변수타입 매개변수이름){
        //  실행문;
        //  return; //함수종료
        //  return 반환값; //반환값을 전달하면서 함수종료
        //}

        //함수의 호출부(실행부) 형식
        // 함수이름();
        //함수이름( 입력 매개변수값 );




    }
}
